{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.8", "config": [{"class_name": "Dense", "config": {"bias_regularizer": null, "units": 164, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "batch_input_shape": [null, 1], "dtype": "float32", "name": "dense_1", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "units": 150, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "dense_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "tanh"}}]}