{"keras_version": "2.0.8", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Dense", "config": {"batch_input_shape": [null, 3], "bias_regularizer": null, "kernel_constraint": null, "units": 300, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_in", "seed": null}}, "dtype": "float32", "trainable": true, "name": "dense_4", "bias_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "units": 600, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_in", "seed": null}}, "use_bias": true, "trainable": true, "name": "dense_5", "bias_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "units": 1, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_in", "seed": null}}, "use_bias": true, "trainable": true, "name": "dense_6", "bias_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "linear"}}]}