{"class_name": "Sequential", "keras_version": "2.0.8", "config": [{"class_name": "Dense", "config": {"units": 164, "batch_input_shape": [null, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "dtype": "float32", "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 1.0, "distribution": "uniform", "seed": null}}}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "tanh"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "bias_constraint": null, "units": 150, "name": "dense_2"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "tanh"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "bias_constraint": null, "units": 1, "name": "dense_3"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "tanh"}}], "backend": "tensorflow"}