{"keras_version": "2.0.8", "config": [{"config": {"trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dtype": "float32", "activation": "linear", "kernel_regularizer": null, "bias_constraint": null, "units": 164, "batch_input_shape": [null, 1], "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "tanh", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "kernel_regularizer": null, "bias_constraint": null, "units": 150, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "tanh", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_in", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "kernel_regularizer": null, "bias_constraint": null, "units": 1, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "tanh", "name": "activation_3"}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential"}